bit-finance/Documents/бит_НазначениеПравилТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_НазначениеПравилТрансляции</Name>
			<BasedOn>
				<xr:Item>Catalog.бит_ПравилаТрансляции</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_НазначениеПравилТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСтруктурныхПодразделений</Name>
					<Comment>Группа структурных подразделений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыСтруктурныхПодразделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала действия правил трансляции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания действия правил трансляции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаТрансляции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПравилоТрансляции</Name>
							<Comment>Правило трансляции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПравилаТрансляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Comment>Приоритет</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Comment>Предназначено для</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_НазначенияПравилТрансляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Comment>Дата начала действия правила трансляции</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Comment>Дата окончания действия правила трансляции</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

bit-finance/InformationRegisters/бит_ПравилаЗаполненияПолейПриТрансляцииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ПравилаЗаполненияПолейПриТрансляцииОбъектов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПравилоЗаполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравилаЗаполненияПолейПриТрансляции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоИсключение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловиеПрименения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Enums/бит_НазначенияПравилТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_НазначенияПравилТрансляции</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Трансляция</Name>
					<Comment>Трансляция</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодборСчетов</Name>
					<Comment>Подбор счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодборТиповПроводок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодборСчетовДляСверкиВГО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрансляцияИПодборСчетов</Name>
					<Comment>Трансляция &amp; подбор счетов</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/бит_ПравилаТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ПравилаТрансляции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.бит_СтруктураКонструктораПравилТрансляции</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаПравилТрансляции</Name>
					<Comment>Настройка структуры конструктора правил трансляции</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтруктураКонструктораПравилТрансляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий - произвольная текстовая информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУсловияТрансляции</Name>
					<Comment>Код условия трансляции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Comment>Источник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приемник</Name>
					<Comment>Приемник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСчет</Name>
					<Comment>Основной счет</Comment>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияРеквизитов</Name>
					<Comment>Значения реквизитов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Comment>ИД строки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКолонки</Name>
							<Comment>Имя колонки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>25</v8:Digits>
									<v8:FractionDigits>9</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>900</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТаблицы</Name>
							<Comment>Имя таблицы</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИерархияСтрок</Name>
					<Comment>Иерархия строк</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДРодителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Documents/бит_НазначениеПравилТрансляции/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.бит_ПравилаТрансляции") Тогда
		НоваяСтрокаПравил = ПравилаТрансляции.Добавить();
	    НоваяСтрокаПравил.ПравилоТрансляции = ДанныеЗаполнения;
		НоваяСтрокаПравил.Назначение = Перечисления.бит_НазначенияПравилТрансляции.Трансляция;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("МассивПравил") Тогда
			ЗаполнитьПоНаборуПравилТрансляции(ДанныеЗаполнения.МассивПравил);
		Иначе
			бит_ОбщегоНазначения.ЗаполнитьПоСтруктуре(ЭтотОбъект, ДанныеЗаполнения, Метаданные());
		КонецЕсли; 
	КонецЕсли;
	
	ЗаполнитьШапкуДокумента();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.бит_НазначениеПравилТрансляции.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Документы.бит_НазначениеПравилТрансляции.СформироватьНазначениеПравилТрнасляции(
		ПараметрыПроведения.НазначениеПравилТрансляции, Движения, Отказ);
		
	Если ОбновитьДанныеСеанса() Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли; 
		
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если ОбновитьДанныеСеанса() Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли; 

КонецПроцедуры
	
Процедура ПриКопировании(ОбъектКопирования)
	
	ЗаполнитьШапкуДокумента(ОбъектКопирования);
	РучнаяКорректировка = Ложь;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьНазначениеПравилЗаполненияПолей(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьШапкуДокумента(ОбъектКопирования = Неопределено)
	
	Дата = ТекущаяДатаСеанса();
	
	// Заполнить реквизиты значениями по умолчанию.
	ДатаНачала = Дата;
		
	// Заполним шапку документа значениями по умолчанию.
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), ОбъектКопирования);
	
КонецПроцедуры // ЗаполнитьШапкуДокумента()

Процедура ЗаполнитьПоНаборуПравилТрансляции(НаборПравил)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборПравил", НаборПравил);
	Запрос.УстановитьПараметр("ДатаНачала",  ТекущаяДатаСеанса());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаТрансляции.Ссылка КАК ПравилоТрансляции,
	|	ЗНАЧЕНИЕ(Перечисление.бит_НазначенияПравилТрансляции.Трансляция) КАК Назначение,
	|	&ДатаНачала КАК ДатаНачала
	|ИЗ
	|	Справочник.бит_ПравилаТрансляции КАК ПравилаТрансляции
	|ГДЕ
	|	НЕ ПравилаТрансляции.ЭтоГруппа
	|	И НЕ ПравилаТрансляции.ПометкаУдаления
	|	И ПравилаТрансляции.Ссылка В(&НаборПравил)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПравилаТрансляции.Добавить(), Выборка);
		НоваяСтрокаПравил = ПравилаТрансляции.Добавить();
	КонецЦикла;

КонецПроцедуры

Функция ОбновитьДанныеСеанса()

	Отбор 	  = Новый Структура("Назначение", Перечисления.бит_НазначенияПравилТрансляции.ПодборТиповПроводок);
	Результат = ПравилаТрансляции.НайтиСтроки(Отбор);

	Возврат ЗначениеЗаполнено(Результат);
	
КонецФункции

Процедура ПроверитьНазначениеПравилЗаполненияПолей(Отказ)
	
	ТаблицаДокумента = ПравилаТрансляции.Выгрузить();
	Для каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаНачала) И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания) Тогда
			СтрокаТаблицы.ДатаНачала	= ДатаНачала;
			СтрокаТаблицы.ДатаОкончания = ДатаОкончания;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДокумента", ТаблицаДокумента);
	Запрос.УстановитьПараметр("КонецПериода", 	  '2037-12-31');
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.ПравилоТрансляции КАК ПравилоТрансляции,
	|	ТаблицаДокумента.ДатаНачала КАК ДатаНачала,
	|	ТаблицаДокумента.ДатаОкончания КАК ДатаОкончания,
	|	ТаблицаДокумента.Назначение КАК Назначение
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПравилаТрансляции.Источник КАК Источник,
	|	ПравилаТрансляции.Приемник КАК Приемник,
	|	ПравилаТрансляции.Ссылка КАК ПравилоТрансляции,
	|	ПравилаТрансляции.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ ВТ_ДанныеПравилТрансляции
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ПравилаТрансляции КАК ПравилаТрансляции
	|		ПО ВТ_ТаблицаДокумента.ПравилоТрансляции = ПравилаТрансляции.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПравилаЗаполненияПолей.Ссылка КАК ПравилоЗаполненияПолей,
	|	ПравилаЗаполненияПолей.Источник КАК Источник,
	|	ПравилаЗаполненияПолей.Приемник КАК Приемник,
	|	ПравилаЗаполненияПолей.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_ДанныеПравилТрансляции.ПравилоТрансляции КАК ПравилоТрансляции
	|ПОМЕСТИТЬ ВТ_ПравилаЗаполненияПолей
	|ИЗ
	|	ВТ_ДанныеПравилТрансляции КАК ВТ_ДанныеПравилТрансляции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ПравилаЗаполненияПолейПриТрансляции КАК ПравилаЗаполненияПолей
	|		ПО ВТ_ДанныеПравилТрансляции.Источник = ПравилаЗаполненияПолей.Источник
	|			И ВТ_ДанныеПравилТрансляции.Приемник = ПравилаЗаполненияПолей.Приемник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПравилаЗаполненияПолей.ПравилоЗаполненияПолей КАК ПравилоЗаполненияПолей,
	|	ВТ_ТаблицаДокумента.ПравилоТрансляции КАК ПравилоТрансляции,
	|	ВТ_ДанныеПравилТрансляции.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_ТаблицаДокумента.ДатаНачала КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокумента.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &КонецПериода
	|		ИНАЧЕ ВТ_ТаблицаДокумента.ДатаОкончания
	|	КОНЕЦ КАК ДатаОкончания,
	|	ВТ_ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаДокумента.Назначение КАК Назначение
	|ПОМЕСТИТЬ ВТ_ДанныеДляПроверки
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПравилаЗаполненияПолей КАК ВТ_ПравилаЗаполненияПолей
	|		ПО ВТ_ТаблицаДокумента.ПравилоТрансляции = ВТ_ПравилаЗаполненияПолей.ПравилоТрансляции
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПравилТрансляции КАК ВТ_ДанныеПравилТрансляции
	|		ПО ВТ_ТаблицаДокумента.ПравилоТрансляции = ВТ_ДанныеПравилТрансляции.ПравилоТрансляции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивныеПравилаЗаполненияПолей.ПравилоЗаполнения КАК ПравилоЗаполнения,
	|	АктивныеПравилаЗаполненияПолей.Период КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА АктивныеПравилаЗаполненияПолей.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &КонецПериода
	|		ИНАЧЕ АктивныеПравилаЗаполненияПолей.ДатаОкончания
	|	КОНЕЦ КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_АктивныеПравилаЗаполненияПолей
	|ИЗ
	|	ВТ_ДанныеДляПроверки КАК ВТ_ДанныеДляПроверки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПравилаЗаполненияПолейПриТрансляцииОбъектов КАК АктивныеПравилаЗаполненияПолей
	|		ПО ВТ_ДанныеДляПроверки.ПравилоЗаполненияПолей = АктивныеПравилаЗаполненияПолей.ПравилоЗаполнения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДляПроверки.ПравилоТрансляции КАК ПравилоТрансляции,
	|	ВТ_ДанныеДляПроверки.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_ДанныеДляПроверки.ДатаНачала КАК ДатаНачала,
	|	ВТ_ДанныеДляПроверки.ДатаОкончания КАК ДатаОкончания,
	|	ВТ_ДанныеДляПроверки.НомерСтроки КАК НомерСтроки,
	|	ВТ_ДанныеДляПроверки.Назначение КАК Назначение,
	|	МИНИМУМ(ВТ_АктивныеПравилаЗаполненияПолей.ПравилоЗаполнения ЕСТЬ NULL) КАК НетПравилЗаполненияПолей
	|ИЗ
	|	ВТ_ДанныеДляПроверки КАК ВТ_ДанныеДляПроверки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АктивныеПравилаЗаполненияПолей КАК ВТ_АктивныеПравилаЗаполненияПолей
	|		ПО ВТ_ДанныеДляПроверки.ПравилоЗаполненияПолей = ВТ_АктивныеПравилаЗаполненияПолей.ПравилоЗаполнения
	|			И (ВТ_ДанныеДляПроверки.ДатаНачала МЕЖДУ ВТ_АктивныеПравилаЗаполненияПолей.ДатаНачала И ВТ_АктивныеПравилаЗаполненияПолей.ДатаОкончания
	|				ИЛИ ВТ_ДанныеДляПроверки.ДатаОкончания МЕЖДУ ВТ_АктивныеПравилаЗаполненияПолей.ДатаНачала И ВТ_АктивныеПравилаЗаполненияПолей.ДатаОкончания)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеДляПроверки.ПравилоТрансляции,
	|	ВТ_ДанныеДляПроверки.ПометкаУдаления,
	|	ВТ_ДанныеДляПроверки.ДатаНачала,
	|	ВТ_ДанныеДляПроверки.ДатаОкончания,
	|	ВТ_ДанныеДляПроверки.НомерСтроки,
	|	ВТ_ДанныеДляПроверки.Назначение
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";	
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
			
		Шаблон = "ПравилаТрансляции[%1].%2";
		
		Поле = СтрШаблон(Шаблон, Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ="), "ПравилоТрансляции");
		Если Выборка.ПометкаУдаления Тогда
			ШаблонСообщения = НСтр("ru = 'Правило трансляции помечено на удаление.';
									|en = 'The conversion rule is marked for deletion.'");
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ",
								НСтр("ru = 'Правило'"), Выборка.НомерСтроки, 
								НСтр("ru = 'Правила трансляции'"), ШаблонСообщения);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
		
		Поле = СтрШаблон(Шаблон, Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ="), "ДатаНачала");
		Если НЕ ЗначениеЗаполнено(Выборка.ДатаНачала) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "ЗАПОЛНЕНИЕ",
								НСтр("ru = 'Дата начала'; en = 'Start Date'"), Выборка.НомерСтроки, 
								НСтр("ru = 'Правила трансляции'"), ШаблонСообщения);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			Продолжить;
		КонецЕсли;
		
		Если НЕ (Выборка.Назначение = Перечисления.бит_НазначенияПравилТрансляции.Трансляция 
			ИЛИ Выборка.Назначение =  Перечисления.бит_НазначенияПравилТрансляции.ТрансляцияИПодборСчетов) Тогда
			Продолжить;			
		КонецЕсли;

		Поле = СтрШаблон(Шаблон, Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ="), "ПравилоТрансляции");
		Если Выборка.НетПравилЗаполненияПолей Тогда
			ШаблонСообщения = НСтр("ru = 'Нет зарегистрированных правил заполнения полей.'; 
									|en = 'There are no registered rules for filling in fields.'") ;
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("КОЛОНКА", "КОРРЕКТНОСТЬ",
								НСтр("ru = 'Правило'"), СтрокаТаблицы.НомерСтроки, 
								НСтр("ru = 'Правила трансляции'"), ШаблонСообщения);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект");
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
